In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus']=False

In [4]:
df = pd.read_excel('../data/hotel.xlsx', index_col='Unnamed: 0')
df

      grade  rate  price
호텔1      10     1   9500
호텔2       8     2   8000
호텔3       6     4   6000
호텔4       9     2   8600
호텔5       7     4   7000
호텔6       8     2   8300
호텔7       5     5   5000
호텔8       5     5   5200
호텔9       8     3   8100
호텔10     10     1   9300
호텔11      9     3   8800
호텔12      7     4   7100
호텔13      8     3   8500
호텔14      5     4   5200
호텔15      5     5   3200
호텔16      6     4   6800
호텔17      7     4   7100
호텔18      8     3   8400
호텔19      5     4   2200
호텔20      5     5   4500

In [5]:
# 중복제거
df['grade'].unique()

array([10,  8,  6,  9,  7,  5], dtype=int64)

In [6]:
df['grade'].value_counts().sort_index()

5     6
6     2
7     3
8     5
9     2
10    2
Name: grade, dtype: int64

In [12]:
# 등급별 가격의 합 (~별) : groupby
# DataFrameGrouBy (집계관련함수 : sum, mean, count, max, min, agg)
g = df.groupby('grade')
# [[컬럼명]] : 데이터프레임, [컬럼명] : 시리즈 형태
g.sum()[['price']] # 집계가능 (숫자) 모든 컬럼

       price
grade
5      25300
6      12800
7      21200
8      41300
9      17400
10     18800

In [13]:
g = df.groupby('grade')
g.mean()[['price']]

             price
grade
5      4216.666667
6      6400.000000
7      7066.666667
8      8260.000000
9      8700.000000
10     9400.000000

In [15]:
g = df.groupby('grade')
g.count()[['price']]

       price
grade
5          6
6          2
7          3
8          5
9          2
10         2

In [20]:
# 집계 결과 여러개 확인 가능
g = df.groupby('grade')
mydf = g.agg(['sum','mean'])['price']
mydf.columns=['가격의 총합','가격의 평균']
mydf

       가격의 총합       가격의 평균
grade
5       25300  4216.666667
6       12800  6400.000000
7       21200  7066.666667
8       41300  8260.000000
9       17400  8700.000000
10      18800  9400.000000